export const locale = {
    lang: 'ar',
    data: {
        'LOGIN': {
            'INTRO': {
                'title': "مرحبًا بك في نظام معلومات إدارة المنشآت!",
                'description': "وسيقوم نظام المعلومات الجديد هذا الذي أنتجته إدارة نظم المعلومات المركزية بإحداث ثورة في عمليات أعمال ADE والتفاعل مع العملاء.",
            },
            'FORM': {
                'title': 'ربط حسابك',
                'USERNAME': {
                    'placeholder': "إسم المستخدم",
                    'ERROR': {
                        'required': "اسم المستخدم مطلوب",
                        'invalid': "يرجى إدخال اسم مستخدم صالح"
                    }
                },
                'PASSWORD': {
                    'placeholder': "كلمة السر",
                    'ERROR': {
                        'required': "كلمة المرور مطلوبة",
                    }
                },
                'REMEMBER': {
                    'label': "يتذكرني"
                },
                'CONNEXION': {
                    'label': "تسجيل الدخول"
                },
                'TOAST': {
                    'success': "تسجيل الدخول بنجاح",
                    'error': "اسم المستخدم أو كلمة المرور غير صالحة",
                }

            }
        }
    }
};